[
  {
    "question": "ما هو الإجراء الذي يجوز للقاضي اتخاذه فيما يتعلق بالديون المؤجلة للمدين بموجب المادة 255؟",
    "ground_truth": "المادة 255 : ١( يترتب علي الحكم بشهر الاعسار أن يحل كل ما في ذمة المذين من ذيون مؤجلة. ويخصم من هذه الديون مقدار الفائدة الاتفاقية أو القانونية عن المدة التي سقطت بسقوط الاجل. (٢( ومع ذلك يجوز للقاضي أن يحكم بناء علي طلب المدين وفي مواجهة ذوي الشأن من دائنيه، بإبقاء الأجل أو مده بالنسبة الي الديون المؤجلة كما يجوز له أن يمنح المدين أجلا بالنسبة الي الديون الحالية إذا رأي أن هذا الاجراء تبرره الظروف، وأنه خير وسيلة تكفل مصالح المدين والدائنين جميعا",
  },
  {
    "question": "ما هي الفئات الثلاث الأولى من الأشخاص الاعتباريين المذكورة في المادة 52؟",
    "ground_truth": "المادة 52 : الأشخاص الاعتبارية هي :- ١( الدولة وكذلك المديريات والمدن والقرى بالشروط التي يحددها القانون والإدارات والمصالح وغيرها من المنشآت العامة التي يمنحها القانون شخصية اعتبارية. ٢( الهيئات والطوائف الدينية التي تعترف لها الدولة بشخصية اعتبارية. ٣( الأوقاف. ٤( الشركات التجارية والمدنية. ٥( الجمعيات والمؤسسات المنشأة وفقاً للأحكام التي ستأتي فيما بعد. ٦( كل مجموعة من الأشخاص أو الأموال تثبت لها الشخصية الاعتبارية بمقتضى نص في القانون",
 }
]